console.log('Lab 7');

//---------- Завдання №1 ----------//

//1. Написати функцію з одним аргументом, яка перевіряє чи є аргумент числом. Якщо так, то повертає чи є це цисло парним чи не парним. Якщо аргумент не число - повертає пусту строку.

function checkNum(argument) {
    if (typeof argument == 'number') { // Перевіряє чи передане значення argument є числом
        if (argument % 2 == 0) { // Перевірка остачі від ділення числа argument на 2, якщо остача 0, то argument ділиться націло на 2, тобто є парним
            return `Число ${argument} парне`; // Якщо число є парним то функція повертає повідомлення про це
        }
        if (argument % 2 == 1) { // Перевірка остачі від ділення числа argument на 2, якщо остача 1, то argument не ділиться націло на 2, тобто є непарним
            return `Число ${argument} непарне`; // Якщо число є непарним то функція повертає повідомлення про це
        }
        // Якщо остача від ділення числа argument на 2 не 0 і не 1, то число не є цілим
        return `Число ${argument} не є цілим числом` // Якщо число не є цілим то функція повертає повідомлення про це
    }
    return `${argument} не є числом`; // Якщо передане значення не є числом то функція повертає повідомлення про це
}

//let example = Number(prompt("Введіть число для перевірки на парність чи непарність")); // Оголошення змінної для передачі її значення у функцію. Метод prompt() для введення значення користувачем. Завжди повертає строчний тип. Перетворення типу змінної із строчного на числовий використовуючи оператор "Number()"

let example = 40; // Оголошення змінної для передачі її значення у функцію
console.log(checkNum(example)); // Вивід значення функції


//---------- Завдання №2 ----------//

//2. Написати функцію, яка починає перебирати числа від 1 до нескінченності і перевіряє чи є число простим (просте число - те яке ділиться лише на 1 чи само на себе). Якщо просто число знайдене - воно додається до масиву. Після пʼятого знайденого простого числа функція повинна повернути суму всіх пʼяти простих чисел в масиві.

function findSimpleNumbers() {
    let arr = []; // Масив для збереження знайдених чисел
    let sum = 0; // Змінна для збереження суми знайдених чисел
    firstFor: for (let i = 1; i < Infinity; i++) { // Перебирання чисел від 1 до нескінченності
        for (let n = 2; n < i; n++) { // Перевірка ділення числа і націло на попередні числа починаючи з 2
            if (i % n == 0) continue firstFor; // Якщо число i ділиться націло на n, то цикл firstFor переходить до наступної ітерації
        }
        // Якщо число і не ділиться на жодне з попередніх націло, то воно є простим 
        arr.push(i); // Занесення значення простого числа в масив
        if (arr.length == 5) { // Якщо довжина масиву буде 5, тобто знайдених простих чисел буде 5, то функція поверне суму значень елементів масиву
            for (let item of arr) { // Цикл перебирає кожен елемент масиву item = arr[i]
                sum += item; // До змінної sum додається значення кожного елементу масиву
            }
            return sum; // Функція повертає суму значень елементів масиву
        }
    }
}

console.log('Сума перших 5 простих чисел:', findSimpleNumbers()); // Вивід значення функції


//---------- Завдання №3 ----------//

//3. Написати функцію з одним аргументом n, що є числом. Функція повинна повернути суму наступного ряду з n чисел 1 + 11 + 111 + 1111 + ...., де кожний елемент - число з постійно зростаючою кількістю одиниць.

function calcSum(n) {
    let num = 0; // Змінна для збереження доданка суми
    let sum = 0; // Змінна для збереження суми доданків
    for (let i = 1; i <= n; i++) { // Цикл для створення суми n доданків
        num += 10 ** (i - 1); // До доданка додається 10 в степені (i-1). Наприклад, до 3 доданка добавиться 10^(3-1) = 10^2 = 100
        //num += Math.pow(10, i - 1); // Піднесення в степінь також можна записати таким чином
        sum += num; // До змінної sum додається свторений вище доданок
    }
    return sum; // Функція повертає значення суми
}

//let number = Number(prompt("Введіть кількість доданків суми")); // Оголошення змінної для передачі її значення у функцію. Метод prompt() для введення значення користувачем. Завжди повертає строчний тип. Перетворення типу змінної із строчного на числовий використовуючи оператор "Number()"

let number = 12; // Оголошення змінної для передачі її значення у функцію
console.log(calcSum(number)); // Вивід значення функції